burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>RFIFOMPF31</name>
          <displayName>RFIFOMPF31</displayName>
          <description>Receive FIFO/mailbox private filter 31 register</description>
          <addressOffset>0x8fc</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFD31</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD30</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD29</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD27</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD26</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD25</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD24</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD23</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD22</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD21</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD20</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD19</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD18</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD17</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD16</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD15</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD14</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD13</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD12</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD11</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD10</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD9</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD8</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD7</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD6</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD5</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD4</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD3</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD2</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD1</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMFD0</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_CTL0</name>
          <displayName>PN_CTL0</displayName>
          <description>Pretended Networking mode control register 0</description>
          <addressOffset>0xB00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>WTOIE</name>
              <description>Wakeup timeout interrupt enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMIE</name>
              <description>Wakeup match interrupt enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMM</name>
              <description>Number of messages matching times</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAFT</name>
              <description>DATA field filtering type in Pretended Networking mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDFT</name>
              <description>ID field filtering type in Pretended Networking mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFT</name>
              <description>Frame filtering type in Pretended Networking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_TO</name>
          <displayName>PN_TO</displayName>
          <description>Pretended Networking mode timeout register</description>
          <addressOffset>0xB04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WTO</name>
              <description>Wakeup timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_STAT</name>
          <displayName>PN_STAT</displayName>
          <description>Pretended Networking mode status register</description>
          <addressOffset>0xB08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>WTOS</name>
              <description>Wakeup timeout flag status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMS</name>
              <description>Wakeup match flag status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMCNT</name>
              <description>Matching message counter in Pretended Networking mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCNTS</name>
              <description>Matching message counter state</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_EID0</name>
          <displayName>PN_EID0</displayName>
          <description>Pretended Networking mode expected identifier 0 register</description>
          <addressOffset>0xB0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIDE</name>
              <description>Expected IDE in Pretended Networking mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERTR</name>
              <description>Expected RTR in Pretended Networking mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EID_ELT</name>
              <description>Expected ID field / expected ID low threshold in Pretended Networking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_EDLC</name>
          <displayName>PN_EDLC</displayName>
          <description>Pretended Networking mode expected DLC register</description>
          <addressOffset>0xB10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>DLCELT</name>
              <description>DLC expected low threshold in Pretended Networking mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLCEHT</name>
              <description>DLC expected high threshold in Pretended Networking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_EDL0</name>
          <displayName>PN_EDL0</displayName>
          <description>Pretended Networking mode expected data low 0 register</description>
          <addressOffset>0xB14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB0ELT</name>
              <description>Data byte 0 expected low threshold in Pretended Networking mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB1ELT</name>
              <description>Data byte 1 expected low threshold in Pretended Networking mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB2ELT</name>
              <description>Data byte 2 expected low threshold in Pretended Networking mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB3ELT</name>
              <description>Data byte 3 expected low threshold in Pretended Networking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_EDL1</name>
          <displayName>PN_EDL1</displayName>
          <description>Pretended Networking mode expected data low 1 register</description>
          <addressOffset>0xB18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB4ELT</name>
              <description>Data byte 4 expected low threshold in Pretended Networking mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB5ELT</name>
              <description>Data byte 5 expected low threshold in Pretended Networking mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB6ELT</name>
              <description>Data byte 6 expected low threshold in Pretended Networking mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB7ELT</name>
              <description>Data byte 7 expected low threshold in Pretended Networking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_IFEID1</name>
          <displayName>PN_IFEID1</displayName>
          <description>Pretended Networking mode identifier filter / expected identifier 1 register</description>
          <addressOffset>0xB1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDEFD</name>
              <description>IDE filter data in Pretended Networking mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTRFD</name>
              <description>RTR filter data in Pretended Networking mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDFD_EHT</name>
              <description>ID filter data / ID expected high threshold in Pretended Networking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_DF0EDH0</name>
          <displayName>PN_DF0EDH0</displayName>
          <description>Pretended Networking mode data 0 filter / expected data high 0 register</description>
          <addressOffset>0xB20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB0FD_EHT</name>
              <description>Data byte 0 filter data / Data byte 0 expected high threshold in Pretended Networking mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB1FD_EHT</name>
              <description>Data byte 1 filter data / Data byte 1 expected high threshold in Pretended Networking mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB2FD_EHT</name>
              <description>Data byte 2 filter data / Data byte 2 expected high threshold in Pretended Networking mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB3FD_EHT</name>
              <description>Data byte 3 filter data / Data byte 2 expected high threshold in Pretended Networking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_DF1EDH1</name>
          <displayName>PN_DF1EDH1</displayName>
          <description>Pretended Networking mode data 1 filter / expected data high 1 register</description>
          <addressOffset>0xB24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB4FD_HTF</name>
              <description>Data byte 4 filter data / Data byte 4 expected high threshold in Pretended Networking mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB5FD_HTF</name>
              <description>Data byte 5 filter data / Data byte 5 expected high threshold in Pretended Networking mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB6FD_HTF</name>
              <description>Data byte 6 filter data / Data byte 6 expected high threshold in Pretended Networking mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB7FD_HTF</name>
              <description>Data byte 7 filter data / Data byte 7 expected high threshold in Pretended Networking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
