burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>CRCCFD</name>
          <displayName>CRCCFD</displayName>
          <description>CRC for classical and FD frame register</description>
          <addressOffset>0xC08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ANTM</name>
              <description>Associated number of mailbox for transmitting the CRCTCI[20:0] value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCTCI</name>
              <description>Transmitted CRC value for classical and ISO / non-ISO FD frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="CAN0">
      <name>CAN1</name>
      <baseAddress>0x4001B000</baseAddress>
      <interrupt>
        <name>CAN1_WK</name>
        <description>CAN1 wakeup through EXTI Line 26 interrupt</description>
        <value>116</value>
      </interrupt>
      <interrupt>
        <name>CAN1_BUFF</name>
        <description>CAN1 interrupt for message buffer</description>
        <value>117</value>
      </interrupt>
      <interrupt>
        <name>CAN1_BUSOFF</name>
        <description>CAN1 interrupt for Bus off / Bus off done</description>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>CAN1_ERROR</name>
        <description>CAN1 interrupt for Error</description>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>CAN1_ERROR_FTX</name>
        <description>CAN1 interrupt for Error in fast transmission</description>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>CAN1_WARNING_TX</name>
        <description>CAN1 interrupt for Transmit warning</description>
        <value>121</value>
      </interrupt>
      <interrupt>
        <name>CAN1_WARNING_RX</name>
        <description>CAN1 interrupt for Receive warning</description>
        <value>122</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CAN0">
      <name>CAN2</name>
      <baseAddress>0x4001C000</baseAddress>
      <interrupt>
        <name>CAN2_WK</name>
        <description>CAN2 wakeup through EXTI Line 27 interrupt</description>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>CAN2_BUFF</name>
        <description>CAN2 interrupt for message buffer</description>
        <value>124</value>
      </interrupt>
      <interrupt>
        <name>CAN2_BUSOFF</name>
        <description>CAN2 interrupt for Bus off / Bus off done</description>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>CAN2_ERROR</name>
        <description>CAN2 interrupt for Error</description>
        <value>126</value>
      </interrupt>
      <interrupt>
        <name>CAN2_ERROR_FTX</name>
        <description>CAN2 interrupt for Error in fast transmission</description>
        <value>127</value>
      </interrupt>
      <interrupt>
        <name>CAN2_WARNING_TX</name>
        <description>CAN2 interrupt for Transmit warning</description>
        <value>128</value>
      </interrupt>
      <interrupt>
        <name>CAN2_WARNING_RX</name>
        <description>CAN2 interrupt for Receive warning</description>
        <value>129</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CAU</name>
      <description>Cryptographic Acceleration Unit</description>
      <groupName>CAU</groupName>
      <baseAddress>0x48021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CAU</name>
        <description>CAU global interrupt</description>
        <value>85</value>
      </interrupt>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NBPILB</name>
              <description>Number of bytes padding in last block of payload</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALGM_3</name>
              <description>Encryption/decryption algorithm mode bit 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GCM_CCMPH</name>
              <description>GCM CCM phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAUEN</name>
              <description>CAU Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEYM</name>
              <description>AES key size mode configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAM</name>
              <description>Data swapping type mode configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALGM</name>
              <description>Encryption/decryption algorithm mode bit 0 to bit 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAUDIR</name>
              <description>CAU direction</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT0</name>
          <displayName>STAT0</displayName>
          <description>Status register 0</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Busy bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OFU</name>
              <description>Output FIFO is full</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ONE</name>
              <description>Output FIFO is not empty</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INF</name>
              <description>Input FIFO is not full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IEM</name>
              <description>Input FIFO is empty</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DI</name>
          <displayName>DI</displayName>
          <description>Data input register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DI</name>
              <description>Data input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DO</name>
          <displayName>DO</displayName>
          <description>Data output register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DO</name>
              <description>Data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAEN</name>
          <displayName>DMAEN</displayName>
          <description>DMA enable register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAOEN</name>
              <description>DMA output enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIEN</name>
              <description>DMA input enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <displayName>INTEN</displayName>
          <description>Interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OINTEN</name>
              <description>OUT FIFO interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IINTEN</name>
              <description>IN FIFO interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT1</name>
          <displayName>STAT1</displayName>
          <description>Status register 1</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OSTA</name>
              <description>OUT FIFO interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISTA</name>
              <description>IN FIFO interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF</name>
          <displayName>INTF</displayName>
          <description>Interrupt flag register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OINTF</name>
              <description>OUT FIFO enabled interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IINTF</name>
              <description>IN FIFO enabled interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY0H</name>
          <displayName>KEY0H</displayName>
          <description>CAU key register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY0H</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY0L</name>
          <displayName>KEY0L</displayName>
          <description>CAU key register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY0L</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1H</name>
          <displayName>KEY1H</displayName>
          <description>CAU key register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY1H</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1L</name>
          <displayName>KEY1L</displayName>
          <description>CAU key register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY1L</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2H</name>
          <displayName>KEY2H</displayName>
          <description>CAU key register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY2H</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2L</name>
          <displayName>KEY2L</displayName>
          <description>CAU key register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY2L</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3H</name>
          <displayName>KEY3H</displayName>
          <description>CAU key register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY3H</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3L</name>
          <displayName>KEY3L</displayName>
          <description>CAU key register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY3L</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IV0H</name>
          <displayName>IV0H</displayName>
          <description>CAU initialization register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV0H</name>
              <description>The initialization vector for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IV0L</name>
          <displayName>IV0L</displayName>
          <description>CAU initialization register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV0L</name>
              <description>The initialization vector for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IV1H</name>
          <displayName>IV1H</displayName>
          <description>CAU initialization register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV1H</name>
              <description>The initialization vector for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IV1L</name>
          <displayName>IV1L</displayName>
          <description>CAU initialization register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV1L</name>
              <description>The initialization vector for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCCMCTXS0</name>
          <displayName>GCMCCMCTXS0</displayName>
          <description>GCM or CCM mode context switch register 0</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX0</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCCMCTXS1</name>
          <displayName>GCMCCMCTXS1</displayName>
          <description>GCM or CCM mode context switch register 1</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX1</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCCMCTXS2</name>
          <displayName>GCMCCMCTXS2</displayName>
          <description>GCM or CCM mode context switch register 2</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX2</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCCMCTXS3</name>
          <displayName>GCMCCMCTXS3</displayName>
          <description>GCM or CCM mode context switch register 3</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX3</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCCMCTXS4</name>
          <displayName>GCMCCMCTXS4</displayName>
          <description>GCM or CCM mode context switch register 4</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX4</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
