burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>GCMCCMCTXS5</name>
          <displayName>GCMCCMCTXS5</displayName>
          <description>GCM or CCM mode context switch register 5</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX5</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCCMCTXS6</name>
          <displayName>GCMCCMCTXS6</displayName>
          <description>GCM or CCM mode context switch register 6</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX6</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCCMCTXS7</name>
          <displayName>GCMCCMCTXS7</displayName>
          <description>GCM or CCM mode context switch register 7</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX7</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS0</name>
          <displayName>GCMCTXS0</displayName>
          <description>GCM  mode context switch register 0</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX0</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS1</name>
          <displayName>GCMCTXS1</displayName>
          <description>GCM mode context switch register 1</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX1</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS2</name>
          <displayName>GCMCTXS2</displayName>
          <description>GCM mode context switch register 2</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX2</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS3</name>
          <displayName>GCMCTXS3</displayName>
          <description>GCM mode context switch register 3</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX3</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS4</name>
          <displayName>GCMCTXS4</displayName>
          <description>GCM mode context switch register 4</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX4</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS5</name>
          <displayName>GCMCTXS5</displayName>
          <description>GCM mode context switch register 5</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX5</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS6</name>
          <displayName>GCMCTXS6</displayName>
          <description>GCM mode context switch register 6</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX6</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS7</name>
          <displayName>GCMCTXS7</displayName>
          <description>GCM mode context switch register 7</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX7</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
