burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>FLT2EMMAX</name>
          <displayName>FLT2EMMAX</displayName>
          <description>Filter 2 extremes monitor maximum regist</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>MAXVAL</name>
              <description>Extremes monitor maximum value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAXDC</name>
              <description>Extremes monitor maximum data channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT3EMMAX</name>
          <displayName>FLT3EMMAX</displayName>
          <description>Filter 3 extremes monitor maximum regist</description>
          <addressOffset>0x2B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>MAXVAL</name>
              <description>Extremes monitor maximum value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAXDC</name>
              <description>Extremes monitor maximum data channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0EMMIN</name>
          <displayName>FLT0EMMIN</displayName>
          <description>Filter 0 extremes monitor minimum regist</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <resetValue>0x7FFFFF00</resetValue>
          <fields>
            <field>
              <name>MINVAL</name>
              <description>Extremes monitor minimum value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINDC</name>
              <description>Extremes monitor minimum data channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT1EMMIN</name>
          <displayName>FLT1EMMIN</displayName>
          <description>Filter 1 extremes monitor minimum regist</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
          <resetValue>0x7FFFFF00</resetValue>
          <fields>
            <field>
              <name>MINVAL</name>
              <description>Extremes monitor minimum value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINDC</name>
              <description>Extremes monitor minimum data channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT2EMMIN</name>
          <displayName>FLT2EMMIN</displayName>
          <description>Filter 2 extremes monitor minimum regist</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <resetValue>0x7FFFFF00</resetValue>
          <fields>
            <field>
              <name>MINVAL</name>
              <description>Extremes monitor minimum value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINDC</name>
              <description>Extremes monitor minimum data channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT3EMMIN</name>
          <displayName>FLT3EMMIN</displayName>
          <description>Filter 3 extremes monitor minimum regist</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x7FFFFF00</resetValue>
          <fields>
            <field>
              <name>MINVAL</name>
              <description>Extremes monitor minimum value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINDC</name>
              <description>Extremes monitor minimum data channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0CT</name>
          <displayName>FLT0CT</displayName>
          <description>Filter 0 conversion timer register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCNT</name>
              <description>Extremes monitor minimum value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT1CT</name>
          <displayName>FLT1CT</displayName>
          <description>Filter 1 conversion timer register</description>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCNT</name>
              <description>Extremes monitor minimum value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT2CT</name>
          <displayName>FLT2CT</displayName>
          <description>Filter 2 conversion timer register</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCNT</name>
              <description>Extremes monitor minimum value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT3CT</name>
          <displayName>FLT3CT</displayName>
          <description>Filter 3 conversion timer register</description>
          <addressOffset>0x2B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCNT</name>
              <description>Timer counting conversion time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
