burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>CHOUTEN</name>
          <displayName>CHOUTEN</displayName>
          <description>HRTIMER channel output enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST7CH1EN</name>
              <description>Slave_TIMER7 channel 1 output (ST7CH1_O) enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST7CH0EN</name>
              <description>Slave_TIMER7 channel 0 output (ST7CH0_O) enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CH1EN</name>
              <description>Slave_TIMER6 channel 1 output (ST6CH1_O) enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CH0EN</name>
              <description>Slave_TIMER6 channel 0 output (ST6CH0_O) enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CH1EN</name>
              <description>Slave_TIMER5 channel 1 output (ST5CH1_O) enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CH0EN</name>
              <description>Slave_TIMER5 channel 0 output (ST5CH0_O) enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CH1EN</name>
              <description>Slave_TIMER4 channel 1 output (ST4CH1_O) enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CH0EN</name>
              <description>Slave_TIMER4 channel 0 output (ST4CH0_O) enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CH1EN</name>
              <description>Slave_TIMER3 channel 1 output (ST3CH1_O) enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CH0EN</name>
              <description>Slave_TIMER3 channel 0 output (ST3CH0_O) enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CH1EN</name>
              <description>Slave_TIMER2 channel 1 output (ST2CH1_O) enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CH0EN</name>
              <description>Slave_TIMER2 channel 0 output (ST2CH0_O) enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CH1EN</name>
              <description>Slave_TIMER1 channel 1 output (ST1CH1_O) enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CH0EN</name>
              <description>Slave_TIMER1 channel 0 output (ST1CH0_O) enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST0CH1EN</name>
              <description>Slave_TIMER0 channel 1 output (ST0CH1_O) enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST0CH0EN</name>
              <description>Slave_TIMER0 channel 0 output (ST0CH0_O) enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHOUTDIS</name>
          <displayName>CHOUTDIS</displayName>
          <description>HRTIMER channel output disable register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST7CH1DIS</name>
              <description>Slave_TIMER7 channel 1 output (ST7CH1_O) disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST7CH0DIS</name>
              <description>Slave_TIMER7 channel 0 output (ST7CH0_O) disable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST6CH1DIS</name>
              <description>Slave_TIMER6 channel 1 output (ST6CH1_O) disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST6CH0DIS</name>
              <description>Slave_TIMER6 channel 0 output (ST6CH0_O) disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST5CH1DIS</name>
              <description>Slave_TIMER5 channel 1 output (ST5CH1_O) disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST5CH0DIS</name>
              <description>Slave_TIMER5 channel 0 output (ST5CH0_O) disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST4CH1DIS</name>
              <description>Slave_TIMER4 channel 1 output (ST4CH1_O) disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST4CH0DIS</name>
              <description>Slave_TIMER4 channel 0 output (ST4CH0_O) disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST3CH1DIS</name>
              <description>Slave_TIMER3 channel 1 output (ST3CH1_O) disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST3CH0DIS</name>
              <description>Slave_TIMER3 channel 0 output (ST3CH0_O) disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST2CH1DIS</name>
              <description>Slave_TIMER2 channel 1 output (ST2CH1_O) disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST2CH0DIS</name>
              <description>Slave_TIMER2 channel 0 output (ST2CH0_O) disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST1CH1DIS</name>
              <description>Slave_TIMER1 channel 1 output (ST1CH1_O) disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST1CH0DIS</name>
              <description>Slave_TIMER1 channel 0 output (ST1CH0_O) disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST0CH1DIS</name>
              <description>Slave_TIMER0 channel 1 output (ST0CH1_O) disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ST0CH0DIS</name>
              <description>Slave_TIMER0 channel 0 output (ST0CH0_O) disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHOUTDISF</name>
          <displayName>CHOUTDISF</displayName>
          <description>HRTIMER channel output disable flag register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST7CH1DISF</name>
              <description>Slave_TIMER7 channel 1 output (ST7CH1_O) disable flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST7CH0DISF</name>
              <description>Slave_TIMER7 channel 0 output (ST7CH0_O) disable flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST6CH1DISF</name>
              <description>Slave_TIMER6 channel 1 output (ST6CH1_O) disable flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST6CH0DISF</name>
              <description>Slave_TIMER6 channel 0 output (ST6CH0_O) disable flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST5CH1DISF</name>
              <description>Slave_TIMER5 channel 1 output (ST5CH1_O) disable flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST5CH0DISF</name>
              <description>Slave_TIMER5 channel 0 output (ST5CH0_O) disable flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST4CH1DISF</name>
              <description>Slave_TIMER4 channel 1 output (ST4CH1_O) disable flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST4CH0DISF</name>
              <description>Slave_TIMER4 channel 0 output (ST4CH0_O) disable flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST3CH1DISF</name>
              <description>Slave_TIMER3 channel 1 output (ST3CH1_O) disable flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST3CH0DISF</name>
              <description>Slave_TIMER3 channel 0 output (ST3CH0_O) disable flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST2CH1DISF</name>
              <description>Slave_TIMER2 channel 1 output (ST2CH1_O) disable flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST2CH0DISF</name>
              <description>Slave_TIMER2 channel 0 output (ST2CH0_O) disable flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST1CH1DISF</name>
              <description>Slave_TIMER1 channel 1 output (ST1CH1_O) disable flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST1CH0DISF</name>
              <description>Slave_TIMER1 channel 0 output (ST1CH0_O) disable flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST0CH1DISF</name>
              <description>Slave_TIMER0 channel 1 output (ST0CH1_O) disable flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST0CH0DISF</name>
              <description>Slave_TIMER0 channel 0 output (ST0CH0_O) disable flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMCTL</name>
          <displayName>BMCTL</displayName>
          <description>HRTIMER bunch mode control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMOPTF</name>
              <description>Bunch mode operating flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMST7</name>
              <description>Slave_TIMER7 bunch mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMST6</name>
              <description>Slave_TIMER6 bunch mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMST5</name>
              <description>Slave_TIMER5 bunch mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMST4</name>
              <description>Slave_TIMER4 bunch mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMST3</name>
              <description>Slave_TIMER3 bunch mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMST2</name>
              <description>Slave_TIMER2 bunch mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMST1</name>
              <description>Slave_TIMER1 bunch mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMST0</name>
              <description>Slave_TIMER0 bunch mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMMT</name>
              <description>Master_TIMER bunch mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMSE</name>
              <description>Bunch mode shadow enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMPSC</name>
              <description>Bunch mode clock division</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMCLKS</name>
              <description>Bunch mode clock source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMCTN</name>
              <description>Continuous mode in bunch mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMEN</name>
              <description>Bunch mode enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
