burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>ADCTRIGS2</name>
          <displayName>ADCTRIGS2</displayName>
          <description>HRTIMER trigger source 2 to ADC register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRG2ST4PER</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER4 period event</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST4C3</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER4 compare 3 event</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST4C2</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER4 compare 2 event</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST4C1</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER4 compare 1 event</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST3PER</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER3 period event</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST3C3</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER3 compare 3 event</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST3C2</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER3 compare 2 event</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST3C1</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER3 compare 1 event</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST2PER</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER2 period event</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST2C3</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER2 compare 3 event</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST2C2</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER2 compare 2 event</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST2C1</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER2 compare 1 event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST1RST</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER1 reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST1PER</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER1 period event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST1C3</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER1 compare 3 event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST1C2</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER1 compare 2 event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST1C1</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER1 compare 1 event</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST0RST</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER0 reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST0PER</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER0 period event</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST0C3</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER0 compare 3 event</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST0C2</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER0 compare 2 event</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST0C1</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER0 compare 1 event</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2EXEV4</name>
              <description>HRTIMER_ADCTRIG2 on external event 4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2EXEV3</name>
              <description>HRTIMER_ADCTRIG2 on external event 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2EXEV2</name>
              <description>HRTIMER_ADCTRIG2 on external event 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2EXEV1</name>
              <description>HRTIMER_ADCTRIG2 on external event 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2EXEV0</name>
              <description>HRTIMER_ADCTRIG2 on external event 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2MTPER</name>
              <description>HRTIMER_ADCTRIG2 on Master_TIMER period event</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2MTC3</name>
              <description>HRTIMER_ADCTRIG2 on Master_TIMER compare 3 event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2MTC2</name>
              <description>HRTIMER_ADCTRIG2 on Master_TIMER compare 2 event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2MTC1</name>
              <description>HRTIMER_ADCTRIG2 on Master_TIMER compare 1 event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2MTC0</name>
              <description>HRTIMER_ADCTRIG2 on Master_TIMER compare 0 event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRIGS3</name>
          <displayName>ADCTRIGS3</displayName>
          <description>HRTIMER trigger source 3 to ADC register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRG3ST4RST</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER4 reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST4C3</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER4 compare 3 event</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST4C2</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER4 compare 2 event</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST4C1</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER4 compare 1 event</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST3RST</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER3 reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST3PER</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER3 period event</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST3C3</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER3 compare 3 event</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST3C2</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER3 compare 2 event</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST3C1</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER3 compare 1 event</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST2RST</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER2 reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST2PER</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER2 period event</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST2C3</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER2 compare 3 event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST2C2</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER2 compare 2 event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST2C1</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER2 compare 1 event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST1PER</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER1 period event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST1C3</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER1 compare 3 event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST1C2</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER1 compare 2 event</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST1C1</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER1 compare 1 event</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST0PER</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER0 period event</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST0C3</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER0 compare 3 event</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST0C2</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER0 compare 2 event</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST0C1</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER0 compare 1 event</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3EXEV9</name>
              <description>HRTIMER_ADCTRG3 on external event 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3EXEV8</name>
              <description>HRTIMER_ADCTRG3 on external event 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3EXEV7</name>
              <description>HRTIMER_ADCTRG3 on external event 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3EXEV6</name>
              <description>HRTIMER_ADCTRG3 on external event 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3EXEV5</name>
              <description>HRTIMER_ADCTRG3 on external event 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3MTPER</name>
              <description>HRTIMER_ADCTRG3 on Master_TIMER period event</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3MTC3</name>
              <description>HRTIMER_ADCTRG3 on Master_TIMER compare 3 event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3MTC2</name>
              <description>HRTIMER_ADCTRG3 on Master_TIMER compare 2 event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3MTC1</name>
              <description>HRTIMER_ADCTRG3 on Master_TIMER compare 1 event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3MTC0</name>
              <description>HRTIMER_ADCTRG3 on Master_TIMER compare 0 event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLLCCTL</name>
          <displayName>DLLCCTL</displayName>
          <description>HRTIMER DLL calibration control register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLBPER</name>
              <description>DLL calibration period</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLBPEREN</name>
              <description>DLL periodic calibration enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLBSTRT</name>
              <description>DLL calibration start once</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
