burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>DMAUPST1R</name>
          <displayName>DMAUPST1R</displayName>
          <description>HRTIMER DMA update Slave_TIMERx regist 1</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST1ACTL</name>
              <description>HRTIMER_ST1ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1EXEVFCFG2</name>
              <description>HRTIMER_ST1EXEVFCFG2 update by DMA mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CTL1</name>
              <description>HRTIMER_ST1CTL1 update by DMA mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1FLTCTL</name>
              <description>HRTIMER_ST1FLTCTL update by DMA mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CHOCTL</name>
              <description>HRTIMER_ST1CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CSCTL</name>
              <description>HRTIMER_ST1CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CNTRST</name>
              <description>HRTIMER_ST1CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1EXEVFCFG1</name>
              <description>HRTIMER_ST1EXEVFCFG1update by DMA mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1EXEVFCFG0</name>
              <description>HRTIMER_ST1EXEVFCFG0update by DMA mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CH1RST</name>
              <description>HRTIMER_ST1CH1RST update by DMA mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CH1SET</name>
              <description>HRTIMER_ST1CH1SET update by DMA mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CH0RST</name>
              <description>HRTIMER_ST1CH0RST update by DMA mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CH0SET</name>
              <description>HRTIMER_ST1CH0SET update by DMA mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1DTCTL</name>
              <description>HRTIMER_ST1DTCTL update by DMA mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CMP3V</name>
              <description>HRTIMER_ST1CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CMP2V</name>
              <description>HRTIMER_ST1CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CMP1V</name>
              <description>HRTIMER_ST1CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CMP0V</name>
              <description>HRTIMER_ST1CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CREP</name>
              <description>HRTIMER_ST1CREP update by DMA mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CAR</name>
              <description>HRTIMER_ST1CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CNT</name>
              <description>HRTIMER_ST1CNT update by DMA mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1DMAINTEN</name>
              <description>HRTIMER_ST1DMAINTEN update by DMA mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1INTC</name>
              <description>HRTIMER_ST1INTC update by DMA mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1CTL0</name>
              <description>HRTIMER_ST1CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAUPST2R</name>
          <displayName>DMAUPST2R</displayName>
          <description>HRTIMER DMA update Slave_TIMERx regist 2</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST2ACTL</name>
              <description>HRTIMER_ST2ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2EXEVFCFG2</name>
              <description>HRTIMER_ST2EXEVFCFG2 update by DMA mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CTL1</name>
              <description>HRTIMER_ST2CTL1 update by DMA mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2FLTCTL</name>
              <description>HRTIMER_ST2FLTCTL update by DMA mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CHOCTL</name>
              <description>HRTIMER_ST2CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CSCTL</name>
              <description>HRTIMER_ST2CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CNTRST</name>
              <description>HRTIMER_ST2CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2EXEVFCFG1</name>
              <description>HRTIMER_ST2EXEVFCFG1update by DMA mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2EXEVFCFG0</name>
              <description>HRTIMER_ST2EXEVFCFG0update by DMA mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CH1RST</name>
              <description>HRTIMER_ST2CH1RST update by DMA mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CH1SET</name>
              <description>HRTIMER_ST2CH1SET update by DMA mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CH0RST</name>
              <description>HRTIMER_ST2CH0RST update by DMA mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CH0SET</name>
              <description>HRTIMER_ST2CH0SET update by DMA mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2DTCTL</name>
              <description>HRTIMER_ST2DTCTL update by DMA mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CMP3V</name>
              <description>HRTIMER_ST2CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CMP2V</name>
              <description>HRTIMER_ST2CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CMP1V</name>
              <description>HRTIMER_ST2CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CMP0V</name>
              <description>HRTIMER_ST2CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CREP</name>
              <description>HRTIMER_ST2CREP update by DMA mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CAR</name>
              <description>HRTIMER_ST2CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CNT</name>
              <description>HRTIMER_ST2CNT update by DMA mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2DMAINTEN</name>
              <description>HRTIMER_ST2DMAINTEN update by DMA mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2INTC</name>
              <description>HRTIMER_ST2INTC update by DMA mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CTL0</name>
              <description>HRTIMER_ST2CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAUPST3R</name>
          <displayName>DMAUPST3R</displayName>
          <description>HRTIMER DMA update Slave_TIMERx regist 3</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST3ACTL</name>
              <description>HRTIMER_ST3ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3EXEVFCFG2</name>
              <description>HRTIMER_ST3EXEVFCFG2 update by DMA mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CTL1</name>
              <description>HRTIMER_ST3CTL1 update by DMA mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3FLTCTL</name>
              <description>HRTIMER_ST3FLTCTL update by DMA mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CHOCTL</name>
              <description>HRTIMER_ST3CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CSCTL</name>
              <description>HRTIMER_ST3CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CNTRST</name>
              <description>HRTIMER_ST3CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3EXEVFCFG1</name>
              <description>HRTIMER_ST3EXEVFCFG1update by DMA mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3EXEVFCFG0</name>
              <description>HRTIMER_ST3EXEVFCFG0update by DMA mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CH1RST</name>
              <description>HRTIMER_ST3CH1RST update by DMA mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CH1SET</name>
              <description>HRTIMER_ST3CH1SET update by DMA mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CH0RST</name>
              <description>HRTIMER_ST3CH0RST update by DMA mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CH0SET</name>
              <description>HRTIMER_ST3CH0SET update by DMA mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3DTCTL</name>
              <description>HRTIMER_ST3DTCTL update by DMA mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CMP3V</name>
              <description>HRTIMER_ST3CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CMP2V</name>
              <description>HRTIMER_ST3CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CMP1V</name>
              <description>HRTIMER_ST3CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CMP0V</name>
              <description>HRTIMER_ST3CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CREP</name>
              <description>HRTIMER_ST3CREP update by DMA mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CAR</name>
              <description>HRTIMER_ST3CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CNT</name>
              <description>HRTIMER_ST3CNT update by DMA mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3DMAINTEN</name>
              <description>HRTIMER_ST3DMAINTEN update by DMA mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3INTC</name>
              <description>HRTIMER_ST3INTC update by DMA mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CTL0</name>
              <description>HRTIMER_ST3CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
