burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>DMAUPST4R</name>
          <displayName>DMAUPST4R</displayName>
          <description>HRTIMER DMA update Slave_TIMERx regist 4</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST4ACTL</name>
              <description>HRTIMER_ST4ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4EXEVFCFG2</name>
              <description>HRTIMER_ST4EXEVFCFG2 update by DMA mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CTL1</name>
              <description>HRTIMER_ST4CTL1 update by DMA mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4FLTCTL</name>
              <description>HRTIMER_ST4FLTCTL update by DMA mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CHOCTL</name>
              <description>HRTIMER_ST4CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CSCTL</name>
              <description>HRTIMER_ST4CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CNTRST</name>
              <description>HRTIMER_ST4CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4EXEVFCFG1</name>
              <description>HRTIMER_ST4EXEVFCFG1update by DMA mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4EXEVFCFG0</name>
              <description>HRTIMER_ST4EXEVFCFG0update by DMA mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CH1RST</name>
              <description>HRTIMER_ST4CH1RST update by DMA mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CH1SET</name>
              <description>HRTIMER_ST4CH1SET update by DMA mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CH0RST</name>
              <description>HRTIMER_ST4CH0RST update by DMA mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CH0SET</name>
              <description>HRTIMER_ST4CH0SET update by DMA mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4DTCTL</name>
              <description>HRTIMER_ST4DTCTL update by DMA mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CMP3V</name>
              <description>HRTIMER_ST4CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CMP2V</name>
              <description>HRTIMER_ST4CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CMP1V</name>
              <description>HRTIMER_ST4CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CMP0V</name>
              <description>HRTIMER_ST4CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CREP</name>
              <description>HRTIMER_ST4CREP update by DMA mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CAR</name>
              <description>HRTIMER_ST4CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CNT</name>
              <description>HRTIMER_ST4CNT update by DMA mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4DMAINTEN</name>
              <description>HRTIMER_ST4DMAINTEN update by DMA mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4INTC</name>
              <description>HRTIMER_ST4INTC update by DMA mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CTL0</name>
              <description>HRTIMER_ST4CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAUPST5R</name>
          <displayName>DMAUPST5R</displayName>
          <description>HRTIMER DMA update Slave_TIMERx regist 5</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST5ACTL</name>
              <description>HRTIMER_ST5ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5EXEVFCFG2</name>
              <description>HRTIMER_ST5EXEVFCFG2 update by DMA mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CTL1</name>
              <description>HRTIMER_ST5CTL1 update by DMA mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5FLTCTL</name>
              <description>HRTIMER_ST5FLTCTL update by DMA mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CHOCTL</name>
              <description>HRTIMER_ST5CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CSCTL</name>
              <description>HRTIMER_ST5CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CNTRST</name>
              <description>HRTIMER_ST5CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5EXEVFCFG1</name>
              <description>HRTIMER_ST5EXEVFCFG1update by DMA mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5EXEVFCFG0</name>
              <description>HRTIMER_ST5EXEVFCFG0update by DMA mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CH1RST</name>
              <description>HRTIMER_ST5CH1RST update by DMA mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CH1SET</name>
              <description>HRTIMER_ST5CH1SET update by DMA mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CH0RST</name>
              <description>HRTIMER_ST5CH0RST update by DMA mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CH0SET</name>
              <description>HRTIMER_ST5CH0SET update by DMA mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5DTCTL</name>
              <description>HRTIMER_ST5DTCTL update by DMA mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CMP3V</name>
              <description>HRTIMER_ST5CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CMP2V</name>
              <description>HRTIMER_ST5CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CMP1V</name>
              <description>HRTIMER_ST5CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CMP0V</name>
              <description>HRTIMER_ST5CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CREP</name>
              <description>HRTIMER_ST5CREP update by DMA mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CAR</name>
              <description>HRTIMER_ST5CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CNT</name>
              <description>HRTIMER_ST5CNT update by DMA mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5DMAINTEN</name>
              <description>HRTIMER_ST5DMAINTEN update by DMA mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5INTC</name>
              <description>HRTIMER_ST5INTC update by DMA mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CTL0</name>
              <description>HRTIMER_ST5CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAUPST6R</name>
          <displayName>DMAUPST6R</displayName>
          <description>HRTIMER DMA update Slave_TIMERx regist 6</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST6ACTL</name>
              <description>HRTIMER_ST6ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6EXEVFCFG2</name>
              <description>HRTIMER_ST6EXEVFCFG2 update by DMA mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CTL1</name>
              <description>HRTIMER_ST6CTL1 update by DMA mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6FLTCTL</name>
              <description>HRTIMER_ST6FLTCTL update by DMA mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CHOCTL</name>
              <description>HRTIMER_ST6CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CSCTL</name>
              <description>HRTIMER_ST6CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CNTRST</name>
              <description>HRTIMER_ST6CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6EXEVFCFG1</name>
              <description>HRTIMER_ST6EXEVFCFG1update by DMA mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6EXEVFCFG0</name>
              <description>HRTIMER_ST6EXEVFCFG0update by DMA mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CH1RST</name>
              <description>HRTIMER_ST6CH1RST update by DMA mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CH1SET</name>
              <description>HRTIMER_ST6CH1SET update by DMA mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CH0RST</name>
              <description>HRTIMER_ST6CH0RST update by DMA mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CH0SET</name>
              <description>HRTIMER_ST6CH0SET update by DMA mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6DTCTL</name>
              <description>HRTIMER_ST6DTCTL update by DMA mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CMP3V</name>
              <description>HRTIMER_ST6CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CMP2V</name>
              <description>HRTIMER_ST6CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CMP1V</name>
              <description>HRTIMER_ST6CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CMP0V</name>
              <description>HRTIMER_ST6CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CREP</name>
              <description>HRTIMER_ST6CREP update by DMA mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CAR</name>
              <description>HRTIMER_ST6CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CNT</name>
              <description>HRTIMER_ST6CNT update by DMA mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6DMAINTEN</name>
              <description>HRTIMER_ST6DMAINTEN update by DMA mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6INTC</name>
              <description>HRTIMER_ST6INTC update by DMA mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CTL0</name>
              <description>HRTIMER_ST6CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
