burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>FLTINCFG3</name>
          <displayName>FLTINCFG3</displayName>
          <description>HRTIMER fault input configuration register 3</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLT7RST</name>
              <description>Fault 7 reset mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT7CNTRST</name>
              <description>Fault 7 counter reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT7CNT</name>
              <description>Fault 7 counter</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT7BLKS</name>
              <description>Fault 7 blanking source</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT7BLKEN</name>
              <description>Fault 7 blanking enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT6RST</name>
              <description>Fault 6 reset mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT6CNTRST</name>
              <description>Fault 6 counter reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT6CNT</name>
              <description>Fault 6 counter</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT6BLKS</name>
              <description>Fault 6 blanking source</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT6BLKEN</name>
              <description>Fault 6 blanking enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT5RST</name>
              <description>Fault 5 reset mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT5CNTRST</name>
              <description>Fault 5 counter reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT5CNT</name>
              <description>Fault 5 counter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT5BLKS</name>
              <description>Fault 5 blanking source</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT5BLKEN</name>
              <description>Fault 5 blanking enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT4RST</name>
              <description>Fault 4 reset mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT4CNTRST</name>
              <description>Fault 4 counter reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT4CNT</name>
              <description>Fault 4 counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT4BLKS</name>
              <description>Fault 4 blanking source</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT4BLKEN</name>
              <description>Fault 4 blanking enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMSTRGA</name>
          <displayName>BMSTRGA</displayName>
          <description>HRTIMER bunch mode start trigger add register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST7CMP1</name>
              <description>Slave_TIMER7 compare 1 event triggers bunch mode operation</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST7CMP0</name>
              <description>Slave_TIMER7 compare 0 event triggers bunch mode operation</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST7REP</name>
              <description>Slave_TIMER7 repetition event triggers bunch mode operation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST7RST</name>
              <description>Slave_TIMER7 reset event triggers bunch mode operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CMP1</name>
              <description>Slave_TIMER6 compare 1 event triggers bunch mode operation</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CMP0</name>
              <description>Slave_TIMER6 compare 0 event triggers bunch mode operation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6REP</name>
              <description>Slave_TIMER6 repetition event triggers bunch mode operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6RST</name>
              <description>Slave_TIMER6 reset event triggers bunch mode operation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CMP1</name>
              <description>Slave_TIMER5 compare 1 event triggers bunch mode operation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CMP0</name>
              <description>Slave_TIMER5 compare 0 event triggers bunch mode operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5REP</name>
              <description>Slave_TIMER5 repetition event triggers bunch mode operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5RST</name>
              <description>Slave_TIMER5 reset event triggers bunch mode operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLTINCFG4</name>
          <displayName>FLTINCFG4</displayName>
          <description>HRTIMER fault input configuration register 4</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLT7INPROT</name>
              <description>Protect fault 7 input configuration</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT7INFC</name>
              <description>Fault 7 input filter control</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT7INSRC_0</name>
              <description>Fault 7 input source</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT7INP</name>
              <description>Fault 7 input polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT7INEN</name>
              <description>Fault 7 input enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT6INPROT</name>
              <description>Protect fault 6 input configuration</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT6INFC</name>
              <description>Fault 6 input filter control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT6INSRC_0</name>
              <description>Fault 6 input source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT6INP</name>
              <description>Fault 6 input polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT6INEN</name>
              <description>Fault 6 input enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCEXTTRGA</name>
          <displayName>ADCEXTTRGA</displayName>
          <description>HRTIMER ADC extended trigger add register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADC9TRG_5</name>
              <description>ADC trigger 9 selection This bit selects the ADC trigger 9 source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC8TRG_5</name>
              <description>ADC trigger 8 selection This bit selects the ADC trigger 8 source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC7TRG_5</name>
              <description>ADC trigger 7 selection This bit selects the ADC trigger 7 source</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC6TRG_5</name>
              <description>ADC trigger 6 selection This bit selects the ADC trigger 6 source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC5TRG_5</name>
              <description>ADC trigger 5 selection This bit selects the ADC trigger 5 source</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC4TRG_5</name>
              <description>ADC trigger 4 selection This bit selects the ADC trigger 4 source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRIGS0A</name>
          <displayName>ADCTRIGS0A</displayName>
          <description>HRTIMER trigger source 0 to ADC add register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRG0ST7RST</name>
              <description>HRTIMER_ADCTRIG0 on Slave_TIMER7 reset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST7PER</name>
              <description>HRTIMER_ADCTRIG0 on Slave_TIMER7 period event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST7C3</name>
              <description>HRTIMER_ADCTRG0 on Slave_TIMER7 compare 3 event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST7C2</name>
              <description>HRTIMER_ADCTRG0 on Slave_TIMER7 compare 2 event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST7C1</name>
              <description>HRTIMER_ADCTRG0 on Slave_TIMER7 compare 1 event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST6RST</name>
              <description>HRTIMER_ADCTRIG0 on Slave_TIMER6 reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST6PER</name>
              <description>HRTIMER_ADCTRIG0 on Slave_TIMER6 period event</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST6C3</name>
              <description>HRTIMER_ADCTRG0 on Slave_TIMER6 compare 3 event</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST6C2</name>
              <description>HRTIMER_ADCTRG0 on Slave_TIMER6 compare 2 event</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST6C1</name>
              <description>HRTIMER_ADCTRG0 on Slave_TIMER6 compare 1 event</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST5RST</name>
              <description>HRTIMER_ADCTRIG0 on Slave_TIMER5 reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST5PER</name>
              <description>HRTIMER_ADCTRIG0 on Slave_TIMER5 period event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST5C3</name>
              <description>HRTIMER_ADCTRG0 on Slave_TIMER5 compare 3 event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST5C2</name>
              <description>HRTIMER_ADCTRG0 on Slave_TIMER5 compare 2 event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG0ST5C1</name>
              <description>HRTIMER_ADCTRG0 on Slave_TIMER5 compare 1 event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
