burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>ADCTRIGS1A</name>
          <displayName>ADCTRIGS1A</displayName>
          <description>HRTIMER trigger source 1 to ADC add register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRG1ST7RST</name>
              <description>HRTIMER_ADCTRIG1 on Slave_TIMER7 reset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST7PER</name>
              <description>HRTIMER_ADCTRIG1 on Slave_TIMER7 period event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST7C3</name>
              <description>HRTIMER_ADCTRG1 on Slave_TIMER7 compare 3 event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST7C2</name>
              <description>HRTIMER_ADCTRG1 on Slave_TIMER7 compare 2 event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST7C1</name>
              <description>HRTIMER_ADCTRG1 on Slave_TIMER7 compare 1 event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST6RST</name>
              <description>HRTIMER_ADCTRIG1 on Slave_TIMER6 reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST6PER</name>
              <description>HRTIMER_ADCTRIG1 on Slave_TIMER6 period event</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST6C3</name>
              <description>HRTIMER_ADCTRG1 on Slave_TIMER6 compare 3 event</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST6C2</name>
              <description>HRTIMER_ADCTRG1 on Slave_TIMER6 compare 2 event</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST6C1</name>
              <description>HRTIMER_ADCTRG1 on Slave_TIMER6 compare 1 event</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST5RST</name>
              <description>HRTIMER_ADCTRIG1 on Slave_TIMER5 reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST5PER</name>
              <description>HRTIMER_ADCTRIG1 on Slave_TIMER5 period event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST5C3</name>
              <description>HRTIMER_ADCTRG1 on Slave_TIMER5 compare 3 event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST5C2</name>
              <description>HRTIMER_ADCTRG1 on Slave_TIMER5 compare 2 event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG1ST5C1</name>
              <description>HRTIMER_ADCTRG1 on Slave_TIMER5 compare 1 event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRIGS2A</name>
          <displayName>ADCTRIGS2A</displayName>
          <description>HRTIMER trigger source 2 to ADC add register</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRG2ST7RST</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER7 reset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST7PER</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER7 period event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST7C3</name>
              <description>HRTIMER_ADCTRG2 on Slave_TIMER7 compare 3 event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST7C2</name>
              <description>HRTIMER_ADCTRG2 on Slave_TIMER7 compare 2 event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST7C1</name>
              <description>HRTIMER_ADCTRG2 on Slave_TIMER7 compare 1 event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST6RST</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER6 reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST6PER</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER6 period event</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST6C3</name>
              <description>HRTIMER_ADCTRG2 on Slave_TIMER6 compare 3 event</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST6C2</name>
              <description>HRTIMER_ADCTRG2 on Slave_TIMER6 compare 2 event</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST6C1</name>
              <description>HRTIMER_ADCTRG2 on Slave_TIMER6 compare 1 event</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST5RST</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER5 reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST5PER</name>
              <description>HRTIMER_ADCTRIG2 on Slave_TIMER5 period event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST5C3</name>
              <description>HRTIMER_ADCTRG2 on Slave_TIMER5 compare 3 event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST5C2</name>
              <description>HRTIMER_ADCTRG2 on Slave_TIMER5 compare 2 event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG2ST5C1</name>
              <description>HRTIMER_ADCTRG2 on Slave_TIMER5 compare 1 event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRIGS3A</name>
          <displayName>ADCTRIGS3A</displayName>
          <description>HRTIMER trigger source 3 to ADC add register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRG3ST7RST</name>
              <description>HRTIMER_ADCTRIG3 on Slave_TIMER7 reset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST7PER</name>
              <description>HRTIMER_ADCTRIG3 on Slave_TIMER7 period event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST7C3</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER7 compare 3 event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST7C2</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER7 compare 2 event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST7C1</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER7 compare 1 event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST6RST</name>
              <description>HRTIMER_ADCTRIG3 on Slave_TIMER6 reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST6PER</name>
              <description>HRTIMER_ADCTRIG3 on Slave_TIMER6 period event</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST6C3</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER6 compare 3 event</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST6C2</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER6 compare 2 event</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST6C1</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER6 compare 1 event</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST5RST</name>
              <description>HRTIMER_ADCTRIG3 on Slave_TIMER5 reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST5PER</name>
              <description>HRTIMER_ADCTRIG3 on Slave_TIMER5 period event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST5C3</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER5 compare 3 event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST5C2</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER5 compare 2 event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRG3ST5C1</name>
              <description>HRTIMER_ADCTRG3 on Slave_TIMER5 compare 1 event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
