burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>ST0CH0SET</name>
          <displayName>ST0CH0SET</displayName>
          <description>HRTIMER Slave_TIMER0 channel 0 set request register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH0SUP</name>
              <description>Update event generates channel 0 set request</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEXEV9</name>
              <description>External event 9 generates channel 0 set request</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEXEV8</name>
              <description>External event 8 generates channel 0 set request</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEXEV7</name>
              <description>External event 7 generates channel 0 set request</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEXEV6</name>
              <description>External event 6 generates channel 0 set request</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEXEV5</name>
              <description>External event 5 generates channel 0 set request</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEXEV4</name>
              <description>External event 4 generates channel 0 set request</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEXEV3</name>
              <description>External event 3 generates channel 0 set request</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEXEV2</name>
              <description>External event 2 generates channel 0 set request</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEXEV1</name>
              <description>External event 1 generates channel 0 set request</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEXEV0</name>
              <description>External event 0 generates channel 0 set request</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV8</name>
              <description>interconnection event 8 generates channel 0 set request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV7</name>
              <description>interconnection event 7 generates channel 0 set request</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV6</name>
              <description>interconnection event 6 generates channel 0 set request</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV5</name>
              <description>interconnection event 5 generates channel 0 set request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV4</name>
              <description>interconnection event 4 generates channel 0 set request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV3</name>
              <description>interconnection event 3 generates channel 0 set request</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV2</name>
              <description>interconnection event 2 generates channel 0 set request</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV1</name>
              <description>interconnection event 1 generates channel 0 set request</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV0</name>
              <description>interconnection event 0 generates channel 0 set request</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SMTCMP3</name>
              <description>Master_TIMER compare 3 event generates channel 0 set request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SMTCMP2</name>
              <description>Master_TIMER compare 2 event generates channel 0 set request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SMTCMP1</name>
              <description>Master_TIMER compare 1 event generates channel 0 set request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SMTCMP0</name>
              <description>Master_TIMER compare 0 event generates channel 0 set request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SMTPER</name>
              <description>Master_TIMER period event generates channel 0 set request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SCMP3</name>
              <description>compare 3 event generates channel 0 set request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SCMP2</name>
              <description>compare 2 event generates channel 0 set request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SCMP1</name>
              <description>compare 1 event generates channel 0 set request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SCMP0</name>
              <description>compare 0 event generates channel 0 set request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SPER</name>
              <description>period event generates channel 0 set request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SRST</name>
              <description>reset event generates channel 0 set request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSEV</name>
              <description>Software event generates channel 0 set request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST0CH0RST</name>
          <displayName>ST0CH0RST</displayName>
          <description>HRTIMER Slave_TIMER0 channel 0 reset request register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH0RSUP</name>
              <description>Update event generates channel 0 reset request</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSEXEV9</name>
              <description>External event 9 generates channel 0 reset request</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSEXEV8</name>
              <description>External event 8 generates channel 0 reset request</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSEXEV7</name>
              <description>External event 7 generates channel 0 reset request</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSEXEV6</name>
              <description>External event 6 generates channel 0 reset request</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSEXEV5</name>
              <description>External event 5 generates channel 0 reset request</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSEXEV4</name>
              <description>External event 4 generates channel 0 reset request</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSEXEV3</name>
              <description>External event 3 generates channel 0 reset request</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSEXEV2</name>
              <description>External event 2 generates channel 0 reset request</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSEXEV1</name>
              <description>External event 1 generates channel 0 reset request</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSEXEV0</name>
              <description>External event 0 generates channel 0 reset request</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV8</name>
              <description>interconnection event 8 generates channel 0 reset request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV7</name>
              <description>interconnection event 7 generates channel 0 reset request</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV6</name>
              <description>interconnection event 6 generates channel 0 reset request</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV5</name>
              <description>interconnection event 5 generates channel 0 reset request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV4</name>
              <description>interconnection event 4 generates channel 0 reset request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV3</name>
              <description>interconnection event 3 generates channel 0 reset request</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV2</name>
              <description>interconnection event 2 generates channel 0 reset request</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV1</name>
              <description>interconnection event 1 generates channel 0 reset request</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV0</name>
              <description>interconnection event 0 generates channel 0 reset request</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSMTCMP3</name>
              <description>Master_TIMER compare 3 event generates channel 0 reset request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSMTCMP2</name>
              <description>Master_TIMER compare 2 event generates channel 0 reset request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSMTCMP1</name>
              <description>Master_TIMER compare 1 event generates channel 0 reset request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSMTCMP0</name>
              <description>Master_TIMER compare 0 event generates channel 0 reset request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSMTPER</name>
              <description>Master_TIMER period event generates channel 0 reset request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSCMP3</name>
              <description>compare 3 event generates channel 0 reset request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSCMP2</name>
              <description>compare 2 event generates channel 0 reset request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSCMP1</name>
              <description>compare 1 event generates channel 0 reset request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSCMP0</name>
              <description>compare 0 event generates channel 0 reset request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSPER</name>
              <description>period event generates channel 0 reset request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSRST</name>
              <description>reset event generates channel 0 reset request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSEV</name>
              <description>Software event generates channel 0 reset request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
