burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>ST1EXEVFCFG1</name>
          <displayName>ST1EXEVFCFG1</displayName>
          <description>HRTIMER Slave_TIMER1 external event filter configuration register 1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXEV9FM</name>
              <description>External event 9 filter mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV9MEEN</name>
              <description>External event 9 memorized enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV8FM</name>
              <description>External event 8 filter mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV8MEEN</name>
              <description>External event 8 memorized enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV7FM</name>
              <description>External event 7 filter mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV7MEEN</name>
              <description>External event 7 memorized enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV6FM</name>
              <description>External event 6 filter mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV6MEEN</name>
              <description>External event 6 memorized enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV5FM</name>
              <description>External event 5 filter mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV5MEEN</name>
              <description>External event 0 memorized enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST1CNTRST</name>
          <displayName>ST1CNTRST</displayName>
          <description>HRTIMER Slave_TIMER1 counter reset register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST5CMP1RST</name>
              <description>Slave_TIMER5 compare 1 event resets counter</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CMP3RST</name>
              <description>Slave_TIMER4 compare 3 event resets counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CMP1RST</name>
              <description>Slave_TIMER4 compare 1 event resets counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4CMP0RST</name>
              <description>Slave_TIMER4 compare 0 event resets counter</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CMP3RST</name>
              <description>Slave_TIMER3 compare 3 event resets counter</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CMP1RST</name>
              <description>Slave_TIMER3 compare 1 event resets counter</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3CMP0RST</name>
              <description>Slave_TIMER3 compare 0 event resets counter</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CMP3RST</name>
              <description>Slave_TIMER2 compare 3 event resets counter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CMP1RST</name>
              <description>Slave_TIMER2 compare 1 event resets counter</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2CMP0RST</name>
              <description>Slave_TIMER2 compare 0 event resets counter</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST0CMP3RST</name>
              <description>Slave_TIMER0 compare 3 event resets counter</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST0CMP1RST</name>
              <description>Slave_TIMER0 compare 1 event resets counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST0CMP0RST</name>
              <description>Slave_TIMER0 compare 0 event resets counter</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV9RST</name>
              <description>External event 9 resets counter</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV8RST</name>
              <description>External event 8 resets counter</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV7RST</name>
              <description>External event 7 resets counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV6RST</name>
              <description>External event 6 resets counter</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV5RST</name>
              <description>External event 5 resets counter</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV4RST</name>
              <description>External event 4 resets counter</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV3RST</name>
              <description>External event 3 resets counter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV2RST</name>
              <description>External event 2 resets counter</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV1RST</name>
              <description>External event 1 resets counter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEV0RST</name>
              <description>External event 0 resets counter</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTCMP3RST</name>
              <description>Master_TIMER compare 3 event resets counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTCMP2RST</name>
              <description>Master_TIMER compare 2 event resets counter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTCMP1RST</name>
              <description>Master_TIMER compare 1 event resets counter</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTCMP0RST</name>
              <description>Master_TIMER compare 0 event resets counter</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTPERRST</name>
              <description>Master_TIMER period event resets counter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP3RST</name>
              <description>Slave_TIMER1 compare 3 event resets counter</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1RST</name>
              <description>Slave_TIMER1 compare 1 event resets counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPRST</name>
              <description>Slave_TIMER1 update event resets counter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CMP0RST</name>
              <description>Slave_TIMER5 compare 0 event resets counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST1CSCTL</name>
          <displayName>ST1CSCTL</displayName>
          <description>HRTIMER Slave_TIMER1 carrier-signal control register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSFSTPW</name>
              <description>First carrier-signal pulse width</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSDTY</name>
              <description>Carrier signal duty cycle</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSPRD</name>
              <description>Carrier signal period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST1CAP0TRG</name>
          <displayName>ST1CAP0TRG</displayName>
          <description>HRTIMER Slave_TIMER1 capture 0 trigger register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CP0BST4CMP1</name>
              <description>Capture 0 triggered by compare 1 event of Slave_TIMER4</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST4CMP0</name>
              <description>Capture 0 triggered by compare 0 event of Slave_TIMER4</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST4NA</name>
              <description>Capture 0 triggered by ST4CH0_O output active to inactive transition</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST4A</name>
              <description>Capture 0 triggered by ST4CH0_O output inactive to active transition</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST3CMP1</name>
              <description>Capture 0 triggered by compare 1 event of Slave_TIMER3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST3CMP0</name>
              <description>Capture 0 triggered by compare 0 event of Slave_TIMER3</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST3NA</name>
              <description>Capture 0 triggered by ST3CH0_O output active to inactive transition</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST3A</name>
              <description>Capture 0 triggered by ST3CH0_O output inactive to active transition</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST2CMP1</name>
              <description>Capture 0 triggered by compare 1 event of Slave_TIMER2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST2CMP0</name>
              <description>Capture 0 triggered by compare 0 event of Slave_TIMER2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST2NA</name>
              <description>Capture 0 triggered by ST2CH0_O output active to inactive transition</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST2A</name>
              <description>Capture 0 triggered by ST2CH0_O output inactive to active transition</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST0CMP1</name>
              <description>Capture 0 triggered by compare 1 event of Slave_TIMER0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST0CMP0</name>
              <description>Capture 0 triggered by compare 0 event of Slave_TIMER0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST0NA</name>
              <description>Capture 0 triggered by ST0CH0_O output active to inactive transition</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST0A</name>
              <description>Capture 0 triggered by ST0CH0_O output inactive to active transition</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BEXEV9</name>
              <description>Capture 0 triggered by external event 9</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BEXEV8</name>
              <description>Capture 0 triggered by external event 8</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BEXEV7</name>
              <description>Capture 0 triggered by external event 7</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BEXEV6</name>
              <description>Capture 0 triggered by external event 6</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BEXEV5</name>
              <description>Capture 0 triggered by external event 5</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BEXEV4</name>
              <description>Capture 0 triggered by external event 4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BEXEV3</name>
              <description>Capture 0 triggered by external event 3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BEXEV2</name>
              <description>Capture 0 triggered by external event 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BEXEV1</name>
              <description>Capture 0 triggered by external event 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BEXEV0</name>
              <description>Capture 0 triggered by external event 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BUP</name>
              <description>Capture 0 triggered by update event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BSW</name>
              <description>Capture 0 triggered by software</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
