burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>ST1CAPTRGCOM</name>
          <displayName>ST1CAPTRGCOM</displayName>
          <description>HRTIMER Slave_TIMER1 capture trigger combination register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CP1BST7CMP1</name>
              <description>Capture 1 triggered by compare 1 event of Slave_TIMER7</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST7CMP0</name>
              <description>Capture 1 triggered by compare 0 event of Slave_TIMER7</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST7NA</name>
              <description>Capture 1 triggered by ST0CH0_O output active to inactive transition</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST7A</name>
              <description>Capture 1 triggered by ST0CH0_O output inactive to active transition</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST6CMP1</name>
              <description>Capture 1 triggered by compare 1 event of Slave_TIMER6</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST6CMP0</name>
              <description>Capture 1 triggered by compare 0 event of Slave_TIMER6</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST6NA</name>
              <description>Capture 1 triggered by ST0CH0_O output active to inactive transition</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST6A</name>
              <description>Capture 1 triggered by ST0CH0_O output inactive to active transition</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST5CMP1</name>
              <description>Capture 1 triggered by compare 1 event of Slave_TIMER5</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST5CMP0</name>
              <description>Capture 1 triggered by compare 0 event of Slave_TIMER5</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST5NA</name>
              <description>Capture 1 triggered by ST0CH0_O output active to inactive transition</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1BST5A</name>
              <description>Capture 1 triggered by ST0CH0_O output inactive to active transition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST7CMP1</name>
              <description>Capture 0 triggered by compare 1 event of Slave_TIMER7</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST7CMP0</name>
              <description>Capture 0 triggered by compare 0 event of Slave_TIMER7</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST7NA</name>
              <description>Capture 0 triggered by ST0CH0_O output active to inactive transition</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST7A</name>
              <description>Capture 0 triggered by ST0CH0_O output inactive to active transition</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST6CMP1</name>
              <description>Capture 0 triggered by compare 1 event of Slave_TIMER6</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST6CMP0</name>
              <description>Capture 0 triggered by compare 0 event of Slave_TIMER6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST6NA</name>
              <description>Capture 0 triggered by ST0CH0_O output active to inactive transition</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST6A</name>
              <description>Capture 0 triggered by ST0CH0_O output inactive to active transition</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST5CMP1</name>
              <description>Capture 0 triggered by compare 1 event of Slave_TIMER5</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST5CMP0</name>
              <description>Capture 0 triggered by compare 0 event of Slave_TIMER5</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST5NA</name>
              <description>Capture 0 triggered by ST0CH0_O output active to inactive transition</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0BST5A</name>
              <description>Capture 0 triggered by ST0CH0_O output inactive to active transition</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST1CNTRSTA</name>
          <displayName>ST1CNTRSTA</displayName>
          <description>HRTIMER Slave_TIMER1 counter reset and channel 0/1 set/reset request add register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH1RSSTCNTRST</name>
              <description>Slave_TIMER1 counter reset generates channel 1 reset request</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTCNTRST</name>
              <description>Slave_TIMER1 counter reset generates channel 0 reset request</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1RSSTEV10</name>
              <description>Slave_TIMER1 interconnection event 10 generates channel 1 reset request</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1RSSTEV9</name>
              <description>Slave_TIMER1 interconnection event 9 generates channel 1 reset request</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV10</name>
              <description>Slave_TIMER1 interconnection event 10 generates channel 0 reset request</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSSTEV9</name>
              <description>Slave_TIMER1 interconnection event 9 generates channel 0 reset request</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1SSTCNTRST</name>
              <description>Slave_TIMER1 counter reset generates channel 1 reset request</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTCNTRST</name>
              <description>Slave_TIMER1 counter reset generates channel 0 reset request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1SSTEV10</name>
              <description>Slave_TIMER1 interconnection event 10 generates channel 1 reset request</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1SSTEV9</name>
              <description>Slave_TIMER1 interconnection event 9 generates channel 1 reset request</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV10</name>
              <description>Slave_TIMER1 interconnection event 10 generates channel 0 set request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SSTEV9</name>
              <description>Slave_TIMER1 interconnection event 9 generates channel 1 set request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST7CMP3RST</name>
              <description>Slave_TIMER7 compare 3 event resets counter</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST7CMP1RST</name>
              <description>Slave_TIMER7 compare 1 event resets counter</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST7CMP0RST</name>
              <description>Slave_TIMER7 compare 0 event resets counter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CMP3RST</name>
              <description>Slave_TIMER6 compare 3 event resets counter</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CMP1RST</name>
              <description>Slave_TIMER6 compare 1 event resets counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6CMP0RST</name>
              <description>Slave_TIMER6 compare 0 event resets counter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5CMP3RST</name>
              <description>Slave_TIMER5 compare 3 event resets counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST1ACTL</name>
          <displayName>ST1ACTL</displayName>
          <description>HRTIMER Slave_TIMER1 additional control register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTFCFG</name>
              <description>Falling edge dead-time value configure</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTRCFG</name>
              <description>Rising edge dead-time value configure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTAR</name>
              <description>Fault automatic resume</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPBST7</name>
              <description>Update by Slave_TIMER7 update event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPBST6</name>
              <description>Update by Slave_TIMER6 update event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
