burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register>
          <name>TCMSRAMKEY</name>
          <displayName>TCMSRAMKEY</displayName>
          <description>SYSCFG TCMSRAM key register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WP_KEY</name>
              <description>TCMSRAM write protection key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCMSRAMWP</name>
          <displayName>TCMSRAMWP</displayName>
          <description>SYSCFG TCMSRAM write protection register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>P31WPEN</name>
              <description>TCMSRAM page 31 write protection enable bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P30WPEN</name>
              <description>TCMSRAM page 30 write protection enable bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P29WPEN</name>
              <description>TCMSRAM page 29 write protection enable bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P28WPEN</name>
              <description>TCMSRAM page 28 write protection enable bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P27WPEN</name>
              <description>TCMSRAM page 27 write protection enable bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P26WPEN</name>
              <description>TCMSRAM page 26 write protection enable bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P25WPEN</name>
              <description>TCMSRAM page 25 write protection enable bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P24WPEN</name>
              <description>TCMSRAM page 24 write protection enable bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P23WPEN</name>
              <description>TCMSRAM page 23 write protection enable bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P22WPEN</name>
              <description>TCMSRAM page 22 write protection enable bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P21WPEN</name>
              <description>TCMSRAM page 21 write protection enable bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P20WPEN</name>
              <description>TCMSRAM page 20 write protection enable bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P19WPEN</name>
              <description>TCMSRAM page 19 write protection enable bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P18WPEN</name>
              <description>TCMSRAM page 18 write protection enable bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P17WPEN</name>
              <description>TCMSRAM page 17 write protection enable bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P16WPEN</name>
              <description>TCMSRAM page 16 write protection enable bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P15WPEN</name>
              <description>TCMSRAM page 15 write protection enable bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P14WPEN</name>
              <description>TCMSRAM page 14 write protection enable bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P13WPEN</name>
              <description>TCMSRAM page 13 write protection enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P12WPEN</name>
              <description>TCMSRAM page 12 write protection enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P11WPEN</name>
              <description>TCMSRAM page 11 write protection enable bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P10WPEN</name>
              <description>TCMSRAM page 10 write protection enable bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P9WPEN</name>
              <description>TCMSRAM page 9 write protection enable bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P8WPEN</name>
              <description>TCMSRAM page 8 write protection enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7WPEN</name>
              <description>TCMSRAM page 7 write protection enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6WPEN</name>
              <description>TCMSRAM page 6 write protection enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5WPEN</name>
              <description>TCMSRAM page 5 write protection enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4WPEN</name>
              <description>TCMSRAM page 4 write protection enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3WPEN</name>
              <description>TCMSRAM page 3 write protection enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2WPEN</name>
              <description>TCMSRAM page 2 write protection enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1WPEN</name>
              <description>TCMSRAM page 1 write protection enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P0WPEN</name>
              <description>TCMSRAM page 0 write protection enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPSCTL</name>
          <displayName>CPSCTL</displayName>
          <description>I/O Compensation cell control/status register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPS_RDY</name>
              <description>Compensation cell ready flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPS_EN</name>
              <description>I/O compensation cell enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERCISEL0</name>
          <displayName>TIMERCISEL0</displayName>
          <description>Timer input selection register 0</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMER0_CI3_SEL</name>
              <description>Selects TIMER0_CI3 input</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CI2_SEL</name>
              <description>Selects TIMER0_CI2 input</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CI1_SEL</name>
              <description>Selects TIMER0_CI1 input</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CI0_SEL</name>
              <description>Selects TIMER0_CI0 input</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CI3_SEL</name>
              <description>Selects TIMER7_CI3 input</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CI2_SEL</name>
              <description>Selects TIMER7_CI2 input</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CI1_SEL</name>
              <description>Selects TIMER7_CI1 input</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CI0_SEL</name>
              <description>Selects TIMER7_CI0 input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERCISEL1</name>
          <displayName>TIMERCISEL1</displayName>
          <description>Timer input selection register 1</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMER19_CI3_SEL</name>
              <description>Selects TIMER19_CI3 input</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER19_CI2_SEL</name>
              <description>Selects TIMER19_CI2 input</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER19_CI1_SEL</name>
              <description>Selects TIMER19_CI1 input</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER19_CI0_SEL</name>
              <description>Selects TIMER19_CI0 input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERCISEL2</name>
          <displayName>TIMERCISEL2</displayName>
          <description>Timer input selection register 2</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMER1_CI3_SEL</name>
              <description>TIMER1_CI3 input selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_CI2_SEL</name>
              <description>TIMER1_CI2 input selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_CI1_SEL</name>
              <description>TIMER1_CI1 input selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_CI0_SEL</name>
              <description>TIMER1_CI0 input selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_CI3_SEL</name>
              <description>TIMER2_CI3 input selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_CI2_SEL</name>
              <description>TIMER2_CI2 input selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_CI1_SEL</name>
              <description>TIMER2_CI1 input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_CI0_SEL</name>
              <description>TIMER2_CI0 input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERCISEL3</name>
          <displayName>TIMERCISEL3</displayName>
          <description>Timer input selection register 3</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMER3_CI3_SEL</name>
              <description>TIMER3_CI3 input selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER3_CI2_SEL</name>
              <description>TIMER3_CI2 input selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER3_CI1_SEL</name>
              <description>TIMER3_CI1 input selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER3_CI0_SEL</name>
              <description>TIMER3_CI0 input selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER4_CI3_SEL</name>
              <description>TIMER4_CI3 input selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER4_CI2_SEL</name>
              <description>TIMER4_CI2 input selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER4_CI1_SEL</name>
              <description>TIMER4_CI1 input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER4_CI0_SEL</name>
              <description>TIMER4_CI0 input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERCISEL4</name>
          <displayName>TIMERCISEL4</displayName>
          <description>Timer input selection register 4</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMER16_CI0_SEL</name>
              <description>Selects TIMER16_CI0 input</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER15_CI0_SEL</name>
              <description>Selects TIMER15_CI0 input</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER14_CI1_SEL</name>
              <description>Selects TIMER14_CI1 input</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER14_CI0_SEL</name>
              <description>Selects TIMER14_CI0 input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0CFG0</name>
          <displayName>TIMER0CFG0</displayName>
          <description>TIMER0 configuration register 0</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG2</name>
              <description>Quadrature decoder mode 2 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG1</name>
              <description>Quadrature decoder mode 1 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG0</name>
              <description>Quadrature decoder mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG0">
          <name>TIMER1CFG0</name>
          <displayName>TIMER1CFG0</displayName>
          <description>TIMER1 configuration register 0</description>
          <addressOffset>0x10C</addressOffset>
        </register>
