burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
        <register derivedFrom="SYSCFG.TIMER0CFG0">
          <name>TIMER2CFG0</name>
          <displayName>TIMER2CFG0</displayName>
          <description>TIMER2 configuration register 0</description>
          <addressOffset>0x118</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG0">
          <name>TIMER3CFG0</name>
          <displayName>TIMER3CFG0</displayName>
          <description>TIMER3 configuration register 0</description>
          <addressOffset>0x124</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG0">
          <name>TIMER4CFG0</name>
          <displayName>TIMER4CFG0</displayName>
          <description>TIMER4 configuration register 0</description>
          <addressOffset>0x130</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG0">
          <name>TIMER7CFG0</name>
          <displayName>TIMER7CFG0</displayName>
          <description>TIMER7 configuration register 0</description>
          <addressOffset>0x13C</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG0">
          <name>TIMER19CFG0</name>
          <displayName>TIMER19CFG0</displayName>
          <description>TIMER19 configuration register 0</description>
          <addressOffset>0x154</addressOffset>
        </register>
        <register>
          <name>TIMER0CFG1</name>
          <displayName>TIMER0CFG1</displayName>
          <description>TIMER1 configuration register 1</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG11</name>
              <description>Decoder mode 2 configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG10</name>
              <description>Decoder mode 1 configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG9</name>
              <description>Decoder mode 0 configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG8</name>
              <description>Pause + restart mode configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG7</name>
              <description>Restart + event mode configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG1">
          <name>TIMER1CFG1</name>
          <displayName>TIMER1CFG1</displayName>
          <description>TIMER1 configuration register 1</description>
          <addressOffset>0x110</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG1">
          <name>TIMER2CFG1</name>
          <displayName>TIMER2CFG1</displayName>
          <description>TIMER2 configuration register 1</description>
          <addressOffset>0x11C</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG1">
          <name>TIMER3CFG1</name>
          <displayName>TIMER3CFG1</displayName>
          <description>TIMER3 configuration register 1</description>
          <addressOffset>0x128</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG1">
          <name>TIMER4CFG1</name>
          <displayName>TIMER4CFG1</displayName>
          <description>TIMER4 configuration register 1</description>
          <addressOffset>0x134</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG1">
          <name>TIMER7CFG1</name>
          <displayName>TIMER7CFG1</displayName>
          <description>TIMER7 configuration register 1</description>
          <addressOffset>0x140</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG1">
          <name>TIMER19CFG1</name>
          <displayName>TIMER19CFG1</displayName>
          <description>TIMER19 configuration register 1</description>
          <addressOffset>0x158</addressOffset>
        </register>
        <register>
          <name>TIMER0CFG2</name>
          <displayName>TIMER0CFG2</displayName>
          <description>TIMERx configuration register 2</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG14</name>
              <description>Quadrature decoder mode 4 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG13</name>
              <description>Quadrature decoder mode 3 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG12</name>
              <description>Decoder mode 3 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG2">
          <name>TIMER1CFG2</name>
          <displayName>TIMER1CFG2</displayName>
          <description>TIMER1 configuration register 2</description>
          <addressOffset>0x114</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG2">
          <name>TIMER2CFG2</name>
          <displayName>TIMER2CFG2</displayName>
          <description>TIMER2 configuration register 2</description>
          <addressOffset>0x120</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG2">
          <name>TIMER3CFG2</name>
          <displayName>TIMER3CFG2</displayName>
          <description>TIMER3 configuration register 2</description>
          <addressOffset>0x12C</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG2">
          <name>TIMER4CFG2</name>
          <displayName>TIMER4CFG2</displayName>
          <description>TIMER4 configuration register 2</description>
          <addressOffset>0x138</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG2">
          <name>TIMER7CFG2</name>
          <displayName>TIMER7CFG2</displayName>
          <description>TIMER7 configuration register 2</description>
          <addressOffset>0x144</addressOffset>
        </register>
        <register derivedFrom="SYSCFG.TIMER0CFG2">
          <name>TIMER19CFG2</name>
          <displayName>TIMER19CFG2</displayName>
          <description>TIMER19 configuration register 2</description>
          <addressOffset>0x15C</addressOffset>
        </register>
        <register>
          <name>TIMER14CFG0</name>
          <displayName>TIMER14CFG0</displayName>
          <description>TIMERx configuration register 0</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER14CFG1</name>
          <displayName>TIMER14CFG1</displayName>
          <description>TIMERx configuration register 1</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG7</name>
              <description>Restart + event mode configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER14CFG2</name>
          <displayName>TIMER14CFG2</displayName>
          <description>TIMERx configuration register 2</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
