burakenez/gd32g5x3-cmake-vscode/Projects/GD32G553Q_EVAL/05_USART_HyperTerminal_Interrupt/GD32G5x3.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER5">
      <name>TIMER6</name>
      <groupName>TIMER</groupName>
      <baseAddress>0x40001400</baseAddress>
      <interrupt>
        <name>TIMER6_DAC_1_3</name>
        <description>TIMER6 global interrupt and DAC1/DAC3 underrun error interrupt</description>
        <value>55</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER7</name>
      <groupName>TIMER</groupName>
      <baseAddress>0x40013400</baseAddress>
      <interrupt>
        <name>TIMER7_BRK_TE_ZE</name>
        <description>TIMER19 Break interrupt/ TIMER19 Transition error/TIMER19 zero error</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>TIMER7_UP</name>
        <description>TIMER19 Update interrupt</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>TIMER7_TR_CM_DEC_ZERO</name>
        <description>TIMER7 Trigger and commutation interrupt/TIMER19 Direction Change interrupt/TIMER19 zero</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>TIMER7_CAP</name>
        <description>TIMER7 capture compare interrupt</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>TIMER7_DEC</name>
        <description>TIMER7 decode interrupt</description>
        <value>135</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TMU</name>
      <description>Trigonometric Math Unit</description>
      <groupName>TMU</groupName>
      <baseAddress>0x48024400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMU</name>
        <description>TMU interrupt</description>
        <value>100</value>
      </interrupt>
      <registers>
        <register>
          <name>CS</name>
          <displayName>CS</displayName>
          <description>Control and status register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>ENDF</name>
              <description>End of TMU operation flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVRF</name>
              <description>The flag of overflow</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRIE</name>
              <description>Overflow interrupt enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWIDTH</name>
              <description>Width of input data</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OWIDTH</name>
              <description>Width of output data</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INUM</name>
              <description>The number of times that the TMU_IDATA needs to be written</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ONUM</name>
              <description>The number of times that the TMU_ODATA needs to be read</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDEN</name>
              <description>Enable DMA request to write TMU_IDATA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDEN</name>
              <description>Enable DMA request to read TMU_ODATA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RIE</name>
              <description>Enable interrupt request to read TMU_ODATA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFLTEN</name>
              <description>Input floating point format enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFLTEN</name>
              <description>Output floating point format enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FACTOR</name>
              <description>Scaling factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITRTNUM</name>
              <description>Number of iterations</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode of TMU operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATA</name>
          <displayName>IDATA</displayName>
          <description>Input data register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDATA</name>
              <description>The input data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODATA</name>
          <displayName>ODATA</displayName>
          <description>Output data register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ODATA</name>
              <description>The output data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
